package com.adedom.dodoung

import io.ktor.application.*
import io.ktor.features.*
import io.ktor.gson.*
import io.ktor.response.*
import io.ktor.routing.*
import java.text.SimpleDateFormat
import java.util.*

fun main(args: Array<String>): Unit = io.ktor.server.netty.EngineMain.main(args)

fun Application.module() {
    install(DefaultHeaders)
    install(CallLogging)

    install(ContentNegotiation) {
        gson {
        }
    }

    install(Routing) {
        get("/api/adedom/forecast") {
            val firstName = call.parameters["firstName"]
            val response = ForecastResponse()

            val message: String = when {
                firstName.isNullOrBlank() -> "Please enter your name"
                sumTotalFirstName(firstName) == 0 -> "Please enter a valid name"
                else -> {
                    val numTotalFirstName = sumTotalFirstName(firstName)
                    val numTotalDay = Date().date + Date().day.plus(1)
                    val numTotalForecast = numTotalFirstName + numTotalDay
                    val sdf = SimpleDateFormat("EEEE, dd MMMM yyyy HH:mm")
                    val dateTime = sdf.format(System.currentTimeMillis())

                    val forecast = Forecast(
                        firstName = firstName,
                        numTotalFirstName = numTotalFirstName,
                        numTotalDay = numTotalDay,
                        numTotalForecast = numTotalForecast,
                        forecastMessage = forecastMessage(numTotalForecast),
                        dateTime = dateTime,
                    )
                    response.forecast = forecast
                    response.success = true
                    "Forecast success"
                }
            }

            response.message = message
            call.respond(response)
        }
    }
}

data class ForecastResponse(
    var success: Boolean = false,
    var message: String? = null,
    var forecast: Forecast? = null,
)

data class Forecast(
    val firstName: String? = null,
    val numTotalFirstName: Int? = null,
    val numTotalDay: Int? = null,
    val numTotalForecast: Int? = null,
    val forecastMessage: String? = null,
    val dateTime: String? = null,
)

fun sumTotalFirstName(firstName: String): Int {
    val data = mapOf(
        "อ" to 1, "ั" to 0, "์" to 0, "่" to 0, "้" to 0, "๊" to 0, "๋" to 0, "ๆ" to 0, "็" to 0, "ะ" to 1, "า" to 1,
        "ิ" to 1, "ี" to 1, "ึ" to 1, "ื" to 1, "ุ" to 1, "ู" to 1, "เ" to 1, "แ" to 2, "ฤ" to 1, "ฦ" to 1, "ำ" to 1,
        "ไ" to 1, "โ" to 1, "ใ" to 1, "ๆ" to 1, "ฤ" to 1, "ฦ" to 1, "ก" to 2, "ข" to 2, "ฃ" to 2, "ค" to 2,
        "ฅ" to 2, "ฆ" to 2, "ง" to 2, "จ" to 3, "ฉ" to 3, "ช" to 3, "ซ" to 3, "ฌ" to 3, "ญ" to 3, "ฎ" to 4,
        "ฏ" to 4, "ฐ" to 4, "ฑ" to 4, "ฒ" to 4, "ณ" to 4, "ด" to 7, "ต" to 7, "ถ" to 7, "ท" to 7, "ธ" to 7,
        "น" to 7, "บ" to 5, "ป" to 5, "ผ" to 5, "ฝ" to 5, "พ" to 5, "ฟ" to 5, "ภ" to 5, "ม" to 5, "ย" to 8,
        "ร" to 8, "ล" to 8, "ว" to 8, "ศ" to 6, "ษ" to 6, "ส" to 6, "ห" to 6, "ฬ" to 6, "ฮ" to 6,
    )

    var sum = 0
    firstName.forEachIndexed { index, _ ->
        sum += data[firstName[index].toString()] ?: 0
    }
    return sum
}

fun forecastMessage(total: Int?): String? {
    return when (total) {
        1 -> "ชอบความสง่า มีความน่าเกรงขาม มีอำนาจในตัวเอง มีความเป็นผู้นำ"
        2 -> "นุ่มนวล ชอบหรือเกี่ยวข้องกับจินตนาการ ศิลปะ น้ำ ของสวยงาม สตรีเพศ"
        3 -> "ชอบการจัดการ หุนหันพลันแล่น ชอบใช้กำลังแก้ไขปัญหา หากไม่เป็นกำลังกาย ก็จะเป็นการโต้เถียง ด่าทอ ว่ากล่าว ไมย่อมใคร มักมีกิจกรรมร่วมกับผู้อื่นเสมอ มีความกระตือรือร้นในการบริการ"
        4 -> "ชอบเรื่องการพูดจา ชอบการสื่อสาร การเดินทาง ท่องเที่ยว หาความรู้ชอบ การอ่าน การฟัง การเขียนรวมไปถึงการทำอาหาร การชิมอาหารต่างๆ"
        5 -> "เป็นคนสุขุมรอบคอบ มีบุคลิกที่ดูมั่นคง ไม่ล่อกแล่ก เหลวไหล มีความเป็นครูบาอาจารย์ ชอบเรียนชอบศึกษา ชอบทำบุญ เป็นที่รักใคร่ของผู้หลักผู้ใหญ่"
        6 -> "รักสวยงาม มีเสน่ห์ชอบความสะดวกสบาย ชอบศิลปะทุกชนิด"
        7 -> "อดทน หนักแน่น มั่นคง ไม่ชอบประจบประแจง ไม่ชอบเอาอกเอาใจใคร ชอบคบหาสมาคมกับบุคคลที่อดทน ต่อสู้ มานะ สร้างสรรค์ รวมทั้งผู้ใช้แรงงาน ใส่ใจดูแลคนงาน"
        8 -> "มักสร้างฟอร์ม ปกปิด ลึกลับ อบสร้างเรื่องราวให้ผู้อื่นเข้าใจผิดได้มีการเสนอ ข้อมูที่ไม่ครบถ้วน ชอบเสี่ยงโชค เล่นหวยเล่นหุ้น เก็งกำไรต่างๆ มักนอนดึก ชอบชีวิตกลางคืน"
        9 -> "ชอบเทคโนโลยีการสื่อสาร ชอบเดินทาง ศาสตร์ลี้ลับ จิตศาสตร์ โหราศาสตร์ ไสยศาสตร์ วิทยาศาสตร์ ร่างกายมักไม่สมประกอบ เช่น ผมร่วง หัวล้าน ฟันเหยิน พิการอื่นๆ และมักมีโอกาสที่จะผิดปกติทางเพศ เช่น รักเพศเดียวกัน"
        10 -> "มักอึดอัด เก็บกด มีเรื่องราวตื่นเต้นตกใจ มักขาดสติ ระวังปัญหาหัวใจวาย ถือเกียรติศักดิ์ศรี มักใช้อำนาจในการจัดการ ชอบเป็นผู้บริหาร แต่มักไม่เข้าถึงหัวใจลูกน้อง ทำให้อำนาจไม่เป็นที่ยอมรับ เป็นคนชอบสั่ง ชอบบังคับ ระวังอุบัติเหตุที่เกี่ยวข้องกับไฟ ความร้อนจากแก๊ส รวมถึงควันพิษ"
        11 -> "มีความมุ่งมั่นตั้งใจสูง มีอารมณ์ร้อนแรง รักเกียรติยศมาก ทำอะไรเด่นเป็นสง่าให้คนอื่นได้รู้จัก ชอบเป็นนักการเมือง ชอบเป็นผู้นำ มีความสามารถ มีศิลปะในการผลักดันตนเองให้เป็นผู้นำ สามารถคุมจิตใจคนอื่นได้"
        12 -> "ชอบบริการ ชอบช่วยเหลือจัดการ จริงใจกับผู้อื่น และมักทำอะไรขาดๆ เกินๆ เช่น รักมาก รักเร็ว โกรธง่าย โกรธแรง มักชอบทำอะไรที่เกี่ยวข้องกับการบริการ เกี่ยวข้องกับเหล็ก"
        13 -> "หงุดหงิดง่าย โผงผาง รวดเร็ว ว่องไว รุนแรง มักขาดการยับยั้งชั่งใจ ทำลายล้างสิ่งต่างๆ ทั้งนี้เป็นไปเพื่อการปกป้องเกียรติของตนเองเป็นหลัก ประเภทฆ่าได้หยามไม่ได้ ชอบเล่นกีฬา มักมีบาดแผล มีแผลเป็น เลือดตกยางออก"
        14 -> "พูดจาหนักแน่น มีเหตุมีผล เชื่อมั่นในข้อมูลวิชาการอย่างตรงไปตรงมา สามารถแสดงความเห็นต่างจากผู้อื่นอย่างอิสระ ไม่มีอคติ ไม่เกรงกลัว ให้ความสำคัญกับเรื่องการพูด เรื่องอาหารการกิน"
        15 -> "มีความเป็นผู้ใหญ่ มีบุคลิกน่าเชื่อถือ ในด้านความเป็นผู้ใหญ่ ใจดีรักเด็ก รักลูกหลาน วางตัวน่าเคารพนับถือ มีเสน่ห์ รักความสะดวกสบาย ชอบคิดให้ผู้อื่นทำตามแนวทาง"
        16 -> "มีมิตรภาพดีเพื่อนฝูงมาก เป็นที่รักของคนอื่น มีความจริงใจต่อผู้อื่น อดทน ยอมเสียสละ แบกรับภาระเพื่อเพื่อนฝูง สนใจความงาม ศิลปะ รักสวยงาม"
        17 -> "ดื้อรั้น อดทน ย้ำคิดย้ำทำ มักเกี่ยวข้องกับงานลักษณะของดิน กระดาษ ต้นไม้ เช่น งานด้านเอกสาร เครื่องปั้นดินเผา สถาปนิก วิศวกร หรือทำธุรกิจเกี่ยวกับต้นไม้ มักเป็นคนที่ดูลึกลับ ชอบเก็บตัว บางครั้งชอบออกสังคม แต่บางครั้งชอบออกสังคม แต่บางครั้งก็ไม่ใส่ใจด้านนี้เลย มักทำงานหนัก ปวดเมื่อยง่าย ตับ ไต มักมีปัญหา"
        18 -> "เกี่ยวข้องกับกฎหมาย การสืบค้น ห้องแล็บ ความมืด อบายมุข รวมไปถึงการเดินทาง สื่อสาร ไปเที่ยวก็มักไปในทางวัฒนธรรมมากกว่าเชิงหรูหรา ชอบศึกษา ขุดคุ้ย ค้นคว้า ชอบซ่อมของที่เสียที่พัง เช่น จักรกล ซ่อมรถ"
        19 -> "มักทำอะไรแปลกๆ โดดเดี่ยว มีความเป็นตัวเองสูง มักแก้ง่าย ร่วงโรยเร็ว มีลางสังหรณ์ มีเซนส์พิเศษ เหมาะสำหรับงานที่เกี่ยวข้องกับคนเจ็บ คนป่วย คนตาย เช่น หมอ สัปเหร่อ พยาบาล รวมไปถึงงานโหราศาสตร์ มักชอบหาความสงบ เข้าวัด ปฏิบัติธรรม ชอบเดินทาง ทอ่งเที่ยว เทคโนโลยี"
        20 -> "เป็นคนช่างจินตนาการ แต่เป็นจินตนาการที่ค่อนข้างวกวน เหมือนการพายเรืออยู่ในอ่าง มักเกี่ยวข้องกับการเงิน ธนาคาร น้ำ อาหาร ระวังอุบัติเหตุที่เกี่ยวข้องกับน้ำ ปัญหาสุขภาพมักเป็นเรื่องท้อง เช่น ท้องอืด ท้องเฟ้อ"
        21 -> "ชอบบริการ ชอบช่วยเหลือจัดการ จริงใจกับผู้อื่น และมักทำอะไรขาดๆ เกินๆ เช่น รักมาก รักเร็ว โกรธง่าย โกรธแรง มักชอบทำอะไรที่เกี่ยวข้องกับการบริการ เกี่ยวข้องกับเหล็ก"
        22 -> "เป็นคนไต่่ตรอง ชอบตรวจสอบ จะคบกับใครหรือมีใครเข้ามาต้องสแกน ตรวจสอบ ประเมินในใจว่า เข้ามาด้วยจุดประสงค์ใด ต้องการอะไร พูดจานุ่มนวล มักมีรูปร่างอวบ จินตนาการสูง มักเกี่ยวข้องกับน้ำที่เคลื่อนไหว เช่น แม่น้ำ ลำคลอง น้ำที่มีเสียงดัง มีการเคลื่อนไหว ชอบอาหาร ชอบจับจ่ายการช้อปปิ้ง"
        23 -> "แคล่วคล่องว่องไว คึกคัก เชื่อมั่นในตนเองสูง คิดอะไรแล้วก็มุ่งมั่นจนได้ เชื่อมั่นในข้อมูลของตน เชื่อว่าทำแล้วต้องสำเร็จ แม้ผิดพลาดอย่างไรก็ไม่ถอย ใช้ความผิดพลาดเป็นครู ผลักดันตนเองไปสู่ความสำเร็จได้ มักบอกสอนคนอื่นด้วยความเชื่อมั่น ชนิดที่บอกว่าเมื่อทำตามตนแล้วจะสำเร็จ ต้องการให้คนอื่นเชื่อฟังตนอยู่เสมอ ประทับใจง่าย ความรักเกิดขึ้นอย่างรวดเร็วกระทันหัน เสียตัวกระทันหัน สภุาพสตรีจึงไม่ควรเดินทางในที่เปลี่ยวหรือในทีไม่ปลอดภัย มักมักมีปัญหาสุขภาพ เรื่องฟันหรือกระดูกชิ้นเล็กๆ มีความตื่นเต้นทางเพศรุนแรง รวดเร็ว"
        24 -> "พูดจานุ่มนวล พูดเพราะ สนใจเกี่ยวข้องกับอาหาร รสชาติอาหาร มักแยกแยะรสชาติอาหารได้ดี ชอบอาหารที่มีแพ็คเกจสวยงาม อาหารที่น่าทาน รักสวยรักงาม รักความสะดวกสบาย ความหรหูรา มีจินตนาการ คิดหวังในเรื่องคู่ครอง"
        25 -> "สนใจความรู้กว้างขวาง หลายด้าน หลายแขนง สามารถเรียนรู้ข้ามสาขาวิชาได้ ไปได้ทั้งสายวิทย์ สายศิลป์ มีศิลปะในหัวใจ ไม่ว่าจะทำงานอะไรก็สามารถทำได้ เน้นความรู้ในเชิงกว้างมากกว่าเชิงลึก ไมช่อบพิธีกรรมแต่งงาน รักใครชอบใครก็อยู่กินกันไปเลย มักได้รับโชคลาภจากสตรี"
        26 -> "มีเสน่ห์กับคนที่มีครอบครัวแล้ว มักได้คู่ครองที่เป็นหม้าย เป็นภรรยาน้อย ดังนั้นไปที่ไหนควรติดต่อผู้สูงอายุ คนที่มีครอบครัวแล้ว เพราะจะได้รับการใส่ใจมากกว่าคนหนุ่มๆ สาวๆ หรือคนที่เป็นโสด ต้องระวังความรักแบบปกปิดซ่อนเร้น ความรักกับคนใกล้ชิด การมีความสัมพันธ์ลึกซึ้งกับคนที่ไม่สามารถเปิดเผยกับสังคมได้ มักมีโรคภัยไข้ เจ็บเรื้อรัง มีโรคภัยที่เกี่ยวข้องกับเพศ เช่น มีอาการตกขาวได้ง่าย มักเกี่ยวข้องกับงานประเภทงานเบื้องหลัง งานเลขา งานบัญชี งานแล็บ"
        27 -> "เป็นคนมีความรับผิดชอบสูง มีเรื่องราวให้ต้องแบกรับตลอด บางคนต้องดูแลพ่อแม่เป็นพิเศษ หรืออาจเป็นญาติเป็นลูกหลานที่จะต้องเข้าไปดูแล มักเกี่ยวข้องกับการเดินทาง เทคโนโลยี โดยเฉพาะอย่างยิ่งเทคโนโลยที่เกี่ยวข้องกับดิน กระดาษ ต้นไม้ ก็จะยิ่งตรงตามความหมายของดาวคู่นี้มากขึ้น มักเกี่ยวข้องกับสิ่งศักดิ์สิทธิ์ การทรงเจ้า หมอดู ไสยศาสตร์ทั้งหลาย มุกเหงา ว้าเหว่"
        28 -> "มักเครียด เก็บกด กับปัญหาเรื่องราวเก่าๆ หนี้สิน มักใช้อำนาจที่ผู้อื่นไม่ค่อยยอมรับ เป็นไปในทางบังคับ การสั่งลูกน้องบริวาร ซึ่งการกระทำดังกล่าวอาจได้งาน ตามที่ตั้งใจแต่ไม่ได้ใจลูกน้อง มีเสน่ห์กับคนมีคู่ครองแล้ว รวมไปถึงยิ่งแต่งงานยิ่งทำให้บุคลิกดูดีขึ้น สวยขึ้น ชอบเสี่ยงโชค เก็งกำไร แต่มักไม่ค่อยประสบผล"
        29 -> "เป็นคนมีสิ่งศักดิ์สิทธิ์คุ้มครอง สิ่งศักดิ์สิทธิ์นั้นมักเกี่ยวข้องกับน้ำ อยู่ใกล้น้ำ เช่น หลวงพ่อโสธร หลวงพ่อทวด หลวงพ่อวัดไร่ขิง เจ้าแม่กวนอิม ซึ่งสิ่งศักดิ์สิทธิ์นี้อาจอยู่กับท่านเอง หรือมีคนนำมาให้ หรือเข้าไปผูกพันธ์ ไปกราบไหว้บูชา ไปเช่ามา นอกจากนี้จะมีความสำเร็จเกี่ยวกับเรื่องเดินทาง สื่อสาร เทคโนโลยี ศาสตร์ลี้ลับ มักชอบทำอาหาร และมีสูตรเฉพาะของตนเองที่ดัดแปลงและมีรสชาติที่ดี"
        30 -> "หงุดหงิด ใช้อำนาจ ใช้ความก้าวร้าว ใช้พลังงานโดยไม่คิด ขาดการไตร่ตรอง ไม่มีเหตุผลเพียงพอ แต่ก็สร้างความเกรงขามแก่ผู้อื่น เหมาะสำหรับการจัดการที่ใช้ความรุนแรง เด็ดขาด เช่น ตีเหล็ก ช่างทอง เพชรฆาต โรงงานผลิตอาวุธ"
        31 -> "หงุดหงิดง่าย โผงผาง รวดเร็ว ว่องไว รุนแรง มักขาดการยับยั้งชั่งใจ ทำลายล้างสิ่งต่างๆ ทั้งนี้เป็นไปเพื่อการปกป้องเกียรติของตนเองเป็นหลัก ประเภทฆ่าได้หยามไม่ได้ ชอบเล่นกีฬา มักมีบาดแผล มีแผลเป็น เลือดตกยางออก"
        32 -> "แคล่วคล่องว่องไว คึกคัก เชื่อมั่นในตนเองสูง คิดอะไรแล้วก็มุ่งมั่นจนได้ เชื่อมั่นในข้อมูลของตน เชื่อว่าทำแล้วต้องสำเร็จ แม้ผิดพลาดอย่างไรก็ไม่ถอย ใช้ความผิดพลาดเป็นครู ผลักดันตนเองไปสู่ความสำเร็จได้ มักบอกสอนคนอื่นด้วยความเชื่อมั่น ชนิดที่บอกว่าเมื่อทำตามตนแล้วจะสำเร็จ ต้องการให้คนอื่นเชื่อฟังตนอยู่เสมอ ประทับใจง่าย ความรักเกิดขึ้นอย่างรวดเร็วกระทันหัน เสียตัวกระทันหัน สุภาพสตรีจึงไม่ควรเดินทางในที่เปลี่ยวหรือในทีไม่ปลอดภัย มักมักมีปัญหาสุขภาพ เรื่องฟันหรือกระดูกชิ้นเล็กๆ มีความตื่นเต้นทางเพศรุนแรง รวดเร็ว"
        33 -> "กระตือรือร้นในลักษณะสร้างสรรค์ เป็นที่ประจับใจของผู้อื่น มีบุคลิกภาพที่ดูว่าเป็นคนเก่ง คล่องแคล่ว ก่อให้เกิดเสน่ห์กับผู้พบเห็น รวมทั้งเจ้านายก็ให้การยกย่อง เป็นคนที่จัดการอะไรรวดเร็ว ได้รับความไว้วางใจจากผู้ร่วมงานหรือลูกน้อง"
        34 -> "มีอำนาจในการพูด พูดจาตรงไปตรงมา พูดสั้นแต่ได้ใจความ ด่าแบบผู้ดี ใช้คำสั้นๆ เชือดเฉือนหัวใจคนอื่นได้ ยากที่ใครจะสามารถตอบโต้ ใช่ว่าคนอื่นไม่มี เหตผุลจะตอบโต้แต่ในสถานการณ์ที่พูด คุณครองความได้เปรียบ ทำให้เขาไม่สามารถตอบโต้คุณได้ เป็นคนชอบเดินทาง เดินทางบ่อย เดินทางไกล ชอบทาน อาหารต่างถิ่น ชอบอาหารรสจัดจ้าน เช่น ส้มตำ หรือยำต่างๆ"
        35 -> "ทำอะไรมักดูลึกลับ ทำอะไรมักล่าช้า ทั้งที่มีความกระตือรือร้น ตั้งใจ ไม่ปล่อยปละละเลย แต่ความต้องการกับการกระทำไม่ตรงกัน จึงเกิดความไม่สมดุล เช่น อยากรีบแต่มีเหตุทำให้รีบไม่ออก เป็นคนมีเสน่ห์กับคนมีครอบครัวแล้ว มักเกี่ยวข้องกับงานบัญชี เลขานุการ งานเบื้องหลัง งานซ่อมบำรุง"
        36 -> "มีความขยันและคาดหวังในเรื่องการเงิน การงานและความรัก แต่มักผิดหวัง ยิ่งคาดหวังมากยิ่งพลิกผันได้มากดั่งชะตากลั่นแกล้ง ดังนั้น จึงไม่ควรคาดหวังอะไรมาก ทำทุกอย่างเต็มที่โดยไม่ต้องคาดหวังหรือใส่ใจกับความสำเร็จ มักโดดเดี่ยว รู้สึกว่าตนเองมีช่องว่างกับคนรักโดยที่หาสาเหตุที่ชัดเจนไม่ได้"
        37 -> "มีความขัดแย้งภายในตัวเอง ขยัน อยากรวดเร็ว อยากเปลี่ยนแปลง อย่างรีบเร่ง แต่ก็ได้แค่คิดไม่ค่อยนำมาสู่ความเป็นจริงเท่าไหร่ ส่วนหนึ่งเป็นการย่ำอยู่กับที่ เป็นคนที่มีความเครียด เก็บกด อึดอัด มักใช้อำนาจในทางที่ไม่เป็นธรรม ระบบเลือดในร่างกายผิดปกติ หากเป็นสตรีประจำเดือนมักมาไม่ปกติ หรือเมื่อมีมักจะไม่สบาย มักปวดเมื่อย มักเกร็ง มักเกี่ยวข้องกับไฟ ไม้ ดิน กระดาษ ต้นไม้"
        38 -> "มีความสำเร็จในเรื่องเก็งกำไร หรืองานที่เกี่ยวข้องกับการปกปิดซ่อนเร้น งานเกี่ยวกับอบายมุข งานผิดกฎหมายทั้งหลาย งานเบื้องหลัง งานตัวแทนเจรจา งานนายหน้า เวลาได้อะไรมักได้แบบฟลุ๊คๆ ได้แบบไม่คิดว่าจะได้หรือไดัรับ ผลประโยชน์จากอดีตที่ไม่ใส่ใจแล้ว เช่น สมัครงานไว้ จมลืมแล้วกลับได้รับเลือก"
        39 -> "กระตือรือร้นในทางแปลกๆ เช่น ปรากฏการณ์ลี้ลับ เหนือธรรมชาติ ข่าวลือ เมื่อสนใจอะไรแล้วมักทุ่มเทมาก ใช้พลังงานมากเกินความจำเป็น เกินกว่าผลที่จะได้รับ บางครั้งพลังงานนั้นอาจเป็นโทษ เพราะขาดความระมัดระวัง โดนเฉพาะการปีนป่าย ซ่อมแซมที่สูง อาจเป็นเหตุให้พลัดตกได้"
        40 -> "มักพูดไม่ค่อยรู้เรื่อง ในลักษณะพูดไม่ค่อยได้ยิน พูดไม่ชัดเจน ฟังไม่เข้าใจ บางทีลิ้นรัวเกินไป นิสัยมักเป็นคนชอบเก็บเงิน วางแผนด้านการเงิน มักแบ่งเงินเป็นส่วนๆ เสมอ มักขวยขวายในการหาเงิน ในการรวบรวมเงินตลอดเวลา"
        41 -> "พูดจาหนักแน่น มีเหตุมีผล เชื่อมั่นในข้อมูลวิชาการอย่างตรงไปตรงมา สามารถแสดงความเห็นต่างจากผู้อื่นอย่างอิสระ ไม่มีอคติ ไม่เกรงกลัว ให้ความสำคัญกับเรื่องการพูด เรื่องอาหารการกิน"
        42 -> "พูดจานุ่มนวล พูดเพราะ สนใจเกี่ยวข้องกับอาหาร รสชาติอาหาร มักแยกแยะรสชาติอาหารได้ดี ชอบอาหารที่มีแพ็คเกจสวยงาม อาหารที่น่าทาน รักสวยรักงาม รักความสะดวกสบาย ความหรหูรา มีจินตนาการ คิดหวังในเรื่องคู่ครอง"
        43 -> "มีอำนาจในการพูด พูดจาตรงไปตรงมา พูดสั้นแต่ได้ใจความ ด่าแบบผู้ดี ใช้คำสั้นๆ เชือดเฉือนหัวใจคนอื่นได้ ยากที่ใครจะสามารถตอบโต้ ใช่ว่าคนอื่นไม่มี เหตผุลจะตอบโต้แต่ในสถานการณ์ที่พูด คุณครองความได้เปรียบ ทำให้เขาไม่สามารถตอบโต้คุณได้ เป็นคนชอบเดินทางเดินทางบ่อย เดินทางไกล ชอบทาน อาหารต่างถิ่น ชอบอาหารรสจัดจ้าน เช่น ส้มตำ หรือยำต่างๆ"
        44 -> "พูดจาโน้มน้าวได้ เด่นเรื่องการพูด การเจรจา เหมาะสำหรับการติดต่อสื่อสาร ชอบอาหารประเภทปิ้งย่าง มักเกี่ยวข้องกับงานที่ทำด้านติดต่อ สื่อสาร พูด เขียน ทำอะไรมักเป็นคนวางแผน ไม่ชอบขัดแย้งหรือปะทะกันซึ่งหน้า ทำงานห้องแล็บ ในห้องมืดทึบ เช่น ร้านถ่ายรูป"
        45 -> "พูดจาดี มีเสียงบ่งบอกถึงความสุขุมรอบคอบ แต่เหมาะที่จะพูดผ่านเครื่องมือ สื่อสารมากกว่าพูดทางตรง หากพูดกันตรงๆ ต่อหน้ามักมีปัญหาพูดไม่รู้เรื่อง ฟังไม่เข้าใจ พูดอย่างแต่กลับเข้าใจอีกอย่าง ก่อให้เกิดความเข้าใจผิดได้โดยไม่รู้ตัว เป็นคนที่เกี่ยวข้องกับการเดินทาง การสื่อสาร เทคโนโลยี มักรู้สึกเหงา โดดเดี่ยว"
        46 -> "อึดอัด เก็บกด ร้อนรน เบื่อหน่าย มักรู้สึกว่าทำดีแล้วไม่ได้ดี น้อยใจออกไปทางอยากในทางลงโทษตัวเอง อยากฆ่าตัวตาย อยากเลิก ไม่อยากทำอะไร อยากหยุด อยากออกจากสิ่งต่างๆ มักเกี่ยวข้องกับน้ำทะเล น้ำร้อน ชอบรับประทาน อาหารที่มีส่วนประกอบของน้ำร้อน"
        47 -> "การเติบโต ขยาย โยกย้าย ขยายไปสู่สิ่งที่ดีขึ้น การเปลี่ยนแปลง การเลื่อนขั้นเลื่อนตำแหน่ง การย้ายงานใหม่ ย้ายบ้านใหม่ ซึ่งสิ่งต่างๆ เหล่านี้เป็นแนวทางที่ดีทีจะสร้างฐานที่ดีขึ้นต่อๆ ไป และบอกถึงลักษณะการพูดด้วยน้ำเสียงแข็งๆ หนักแน่น ไม่นุ่มนวล"
        48 -> "มักพูดจาวกวน มีเล่ห์เหลี่ยม ไม่ตรงไปตรงมา มีการวางแผน วางประเด็น การพูดเพื่อโน้มน้าว แต่มักเก็บอาการไม่อยู่เมื่อพูดไม่ตรงกับความจริง จะตื่นเต้น มีพิรุธ ขาดความน่าเชื่อถือ เป็นการพูดแบบพ่อค้าแม่ค้า พูดเพื่อการขาย เหมาะสำหรับงานที่ต้องพูดคนเดียว เช่น นักจัดรายการวิทยุ"
        49 -> "มักเกี่ยวข้องกับการเดินทาง การสื่อสาร เทคโนโลยี มักพูดจากระทบกระเทียบ เปรียบเปรย ประชดประชัน ว่าแดกดัน พูดในลักษณะที่อ้อมค้อม ไม่ตรงไปตรงมา ไม่มีประเด็นที่จะจับมาทำความเข้าใจที่ชัดเจนได้"
        50 -> "ลังเล สงสัย ความจำเสื่อม มึนงง แสวงหาข้อมูลมาก แต่ยากจะหาข้อสรุป ทำให้ไม่สามรถตัดสินใจอะไรได้ โดยเฉพาะในเรื่องที่สำคัญต่างๆ มีความสามารถที่จะเข้าไปศึกษาศาสตร์ลี้ลับที่หาคำตอบชัดเจนไม่ได้ ต้องอาศัยการค้นข้อมูล เช่น ประวัติศาสตร์ รวมถึงไพ่ยิปซี ก็จะทำให้ศึกษาได้แตกฉาน ตรงกับดาวมาก"
        51 -> "มีความเป็นผู้ใหญ่ มีบุคลิกน่าเชื่อถือ ในด้านความเป็นผู้ใหญ่ ใจดีรักเด็ก รักลูกหลาน วางตัวน่าเคารพนับถือ มีเสน่ห์ รักความสะดวกสบาย ชอบคิดให้ผู้อื่นทำตามแนวทาง"
        52 -> "สนใจความรู้กว้างขวางหลายด้านหลายแขนง สามารถเรียนรู้ข้ามสาขาวิชาได้ ไปได้ทั้งสายวิทย์ สายศิลป์ มีศิลปะในหัวใจ ไม่ว่าจะทำงานอะไรก็สามารถทำได้ เน้นความรู้ในเชิงกว้างมากกว่าเชิงลึก ไมช่อบพิธีกรรมแต่งงาน รักใครชอบใครก็อยู่กินกันไปเลย มักได้รับโชคลาภจากสตรี"
        53 -> "ทำอะไรมักดูลึกลับ ทำอะไรมักล่าช้า ทั้งที่มีความกระตือรือร้น ตั้งใจ ไม่ปล่อย ปละละเลย แต่ความต้องการกับการกระทำไม่ตรงกัน จึงเกิดความไม่สมดุล เช่น อยากรีบแต่มีเหตุทำให้รีบไม่ออก เป็นคนมีเสน่ห์กับคนมีครอบครัวแล้ว มักเกี่ยวข้อง กับงานบัญชี เลขานุการ งานเบื้องหลัง งานซ่อมบำรุง"
        54 -> "พูดจาดี มีเสียงบ่งบอกถึงความสุขุมรอบคอบ แต่เหมาะที่จะพูดผ่านเครื่องมือ สื่อสารมากกว่าพูดทางตรง หากพูดกันตรงๆ ต่อหน้ามักมีปัญหาพูดไม่รู้เรื่อง ฟังไม่ เข้าใจ พูดอย่างแต่กลับเข้าใจอีกอย่าง ก่อให้เกิดความเข้าใจผิดได้โดยไม่รู้ตัว เป็นคนที่เกี่ยวข้องกับการเดินทาง การสื่อสาร เทคโนโลยี มักรู้สึกเหงา โดดเดี่ยว"
        55 -> "อึดอัด ร้อนรน รีบเร่งในเรื่องเกี่ยวกับการศึกษา ความรู้ การทำวิทยานิพนธ์ ค้นคว้า วิจัย รีบเร่งเพื่อให้จบการศึกษา มักมีระบบความดันเลือดผิดปกติ ปวดหัว มึนหัวง่าย ระยะนี้มักทำงานกลางแดด ถูกแสงแดดมาก ทำให้ผิวแห้งแตกได้ง่าย"
        56 -> "มีโชคลาภ เป็นช่วงที่ประสบความสำเร็จ ได้รับการนับหน้าถือตา ทั้งจากผู้ใหญ่ และลูกน้องบริวาร มีความสุข อิ่มเอิบ มีความรัก มีความสุข ทำอะไรมักประสบความสำเร็จ"
        57 -> "มักมีการเดินทาง เกี่ยวข้องกับสิ่งลี้ลับ มักเกี่ยวข้องกับพิธีกรรมแปลกๆ ทำอะไรผิดพลาดเกี่ยวกับสิ่งศักดิ์สิทธิ์ สิ่งศักดิ์สิทธิ์ให้โทษ คือ เกิดปัญหาในสิ่งที่ไม่น่าจะเกิด ซึ่งไม่ใช่เรื่องร้ายแรง แต่ก็สร้างความกังวลใจ ปัญหาเรื่องสุขภาพมักหาสาเหตุไม่ได้ จะเป็นเองหายเอง หากไปหาหมอก็มักตรวจไม่พบ"
        58 -> "มักมีเรื่องเดือดร้อนวุ่นวาย อันเนื่องมาจากปัญหาเก่าๆ ปัญหาในอดีต หรือเรื่องที่เกี่ยวกับหนี้สิน ศัตรูที่ไม่เผยตัว มักมีโรคภัยเก่าๆ ปะทุอย่างรุนแรง รวมไปถึงการมีคดีความ เรื่องสัญญาข้อตกลง การถูกทวงหนี้ที่เป็นปัญหาก่อให้เกิดทุกข์อย่างหนัก"
        59 -> "ผู้ใหญ่มักเป็นห่วงมาก และมักแทรกแซงในการดำเนินชีวิต หรือตัดสินใจอะไรบางอย่าง ซึ่งคุณรู้สึกว่าถูกแทรกแซง ไม่ได้รับการไว้วางใจ ไม่มีอิสระ และคณุมองว่าปัญหาที่ผู้ใหญ่เข้ามาแทรกแซงนั้น เขามองไม่ทะลุ ไม่ลึกเท่าคุณเองคำแนะนำเหล่านั้น จึงไม่สามารถนำไปใช้ประโยชน์ได้ แต่อย่างไรเขาก็มีเจตนาที่ดี"
        60 -> "มักไม่ได้อยู่กับคนรักประจำ มีเหตุให้ต้องห่างเหินจากกัน เช่น คนรักไปทำงานในที่ไกลๆ ไม่ได้กลับบ้านประจำ รวมถึงไม่ได้นอนเตียงเดียวกัน มักนอนกันคนละที่คนละทาง แต่หากใกล้ชิดกันมาก อยู่เตียงเดียวกันประจำ จะก่อให้เกิดความอึดอัดเบื่อหน่าย"
        61 -> "มีมิตรภาพดีเพื่อนฝูงมาก เป็นที่รักของคนอื่น มีความจริงใจต่อผู้อื่น อดทน ยอมเสียสละ แบกรับภาระเพื่อเพื่อนฝูง สนใจความงาม ศิลปะ รักสวยงาม"
        62 -> "มีเสน่ห์กับคนที่มีครอบครัวแล้ว มักได้คู่ครองที่เป็นหม้าย เป็นภรรยาน้อย ดังนั้นไปที่ไหนควรติดต่อผู้สูงอายุ คนที่มีครอบครัวแล้ว เพราะจะได้รับการใส่ใจ มากกว่าคนหนุ่มๆ สาวๆ หรือคนที่เป็นโสด ต้องระวังความรักแบบปกปิดซ่อนเร้น ความรักกับคนใกล้ชิด การมีความสัมพันธ์ลึกซึ้งกับคนที่ไม่สามารถเปิดเผยกับสังคมได้ มักมีโรคภัยไข้ เจ็บเรื้อรัง มีโรคภัยที่เกี่ยวข้องกับเพศ เช่น มีอาการตกขาวได้ง่าย มักเกี่ยวข้องกับงานประเภท งานเบื้องหลัง งานเลขา งานบัญชี งานแล็บ"
        63 -> "มีความขยันและคาดหวังในเรื่องการเงิน การงานและความรัก แต่มักผิดหวัง ยิ่งคาดหวังมากยิ่งพลิกผันได้มากดั่งชะตากลั่นแกล้ง ดังนั้น จึงไม่ควรคาดหวังอะไรมาก ทำทุกอย่างเต็มที่โดยไม่ต้องคาดหวังหรือใส่ใจกับความสำเร็จ มักโดดเดี่ยว รู้สึกว่าตนเองมีช่องว่างกับคนรักโดยที่หาสาเหตุที่ชัดเจนไม่ได้"
        64 -> "อึดอัด เก็บกด ร้อนรน เบื่อหน่าย มักรู้สึกว่าทำดีแล้วไม่ได้ดี น้อยใจ ออกไปทางอยากในทางลงโทษตัวเอง อยากฆ่าตัวตาย อยากเลิก ไม่อยากทำอะไร อยากหยุด อยากออกจากสิ่งต่างๆ มักเกี่ยวข้องกับน้ำทะเล น้ำร้อน ชอบรับประทาน อาหารที่มีส่วนประกอบของน้ำร้อน"
        65 -> "มีโชคลาภ เป็นช่วงที่ประสบความสำเร็จ ได้รับการนับหน้าถือตา ทั้งจากผู้ใหญ่และลูกน้องบริวาร มีความสุข อิ่มเอิบ มีความรัก มีความสุข ทำอะไรมักประสบความสำเร็จ"
        66 -> "ให้ความสำคัญในเรื่องความรัก ความสุข ความสะดวกสบายมากขึ้น มักขยันในกิจกรรมเกี่ยวกับเรื่องความรัก แต่มักมีอาการหงุดหงิด งอน ต้องคอยง้อ เอาอกเอาใจกันอยุ่ตลอด และมักเลือกวิธีการเอาอกเอาใจที่ดีที่สุดคือ พากันออกไปช้อปปิ้ง การซื้อของขวัญของฝากให้กัน ไปเที่ยว ไปดูศิลปะ อารมณ์หงุดหงิดก็จะหายไป สถานการณ์จะกลับมาดีเหมือนเดิม โดยไม่ต้องมานั่งเคลียร์กันเลย การแสดงออกไปในทางขาดๆ เกินๆ ไม่ค่อยพอดี"
        67 -> "เกิดความขัดแย้ง ไม่สมดุล เกิดปัญหาต่างๆ มากมายโดยไม่จำเป็นต้องมีสาเหตุ และเกิดได้ทุกเรื่องราว เป็นดาวคู่ร้ายมากคู่หนึ่ง ความรักถูกทำลาย เกิดความผิดหวัง สูญเสียผู้ใหญ่ มีการตายจากการแตกแยก แต่หากมีผู้ใดย้ายออกจากบ้านไป ก็เป็นการแก้เคล็ดได้ และหากเกี่ยวข้องกับการทำลายล้าง เช่น ทุบตึก การฆ่าสัตว์ ปัญหาด้านร้ายนี้ก็อาจไม่มี หากต้องการการเกิดปัญหาจากดาวคู่นี้ ควรมีเพชรใส่ประจำ"
        68 -> "พูดจามีเหตุผล มีความสนใจเรื่องของความรู้ การค้นคว้าข้อมูล อาจมีผู้มาให้ข้อมูล ซึ่งข้อมูลที่ได้เป็นข้อมูลผิดๆ ไม่ถูกต้องทั้งร้อยเปอร์เซนต์ แต่มีความน่าเชื่อถือมาก จนเชื่อมั่นเต็มหัวใจ ซึ่งผู้ให้ข้อมูลอาจไม่ได้ตั้งใจให้ข้อมูลผิดๆ แก่คุณ เพียงแต่สถานการณ์เปลี่ยนแปลง ข้อมูลจึงไม่ตรงตามจริงทั้งหมด"
        69 -> "สนใจเรื่องเทคโนโลยี เรื่องความรัก เรื่องลี้ลับ เกี่ยวข้องกับความรักวิปริตผิดปกติ เช่น รักเพศเดียวกัน หรือมีพฤติกรรมทางเพศที่แตกต่างจากคนทั่วไป รักเทคโนโลยีชอบการเดินทาง ชอบดูภาพยนตร์ มักแสวงหาความสุขทางรัก แต่มักไม่เป็นดังหวัง มักมีช่องว่างกับคนรักเสมอ เหมาะกับการอยู่คนเดียว เข้าวัดปฏิบัติธรรม"
        70 -> "เข้มแข็ง อดทน แต่น้อยใจ มักคิดเสมอว่าตัวเองไม่ได้รับความใส่ใจจากบุคคล ใกล้ชิดใครๆ ก็ไม่สนใจ ใครๆ ก็ไม่รัก มักมีปัญหาเรื่องปวดเมื่อย โดยเฉพาะที่คอ คอเคล็ด ตกหมอน ปวดเมื่อยจากการเดินทางไกล สนใจธุรกิจเกี่ยวข้องกับ กระดาษ ดิน ต้นไม้"
        71 -> "ดื้อรั้น อดทน ย้ำคิดย้ำทำ มักเกี่ยวข้องกับงานลักษณะของดิน กระดาษ ต้นไม้ เช่น งานด้านเอกสาร เครื่องปั้นดินเผา สถาปนิก วิศวกร หรือทำธุรกิจเกี่ยวกับต้นไม้ มักเป็นคนที่ดูลึกลับ ชอบเก็บตัว บางครั้งชอบออกสังคม แต่บางครั้งก็ไม่ชอบออกสังคม แต่บางครั้งก็ไม่ใส่ใจด้านนี้เลย มักทำงานหนัก ปวดเมื่อยง่าย ตับ ไต มักมีปัญหา"
        72 -> "เป็นคนมีความรับผิดชอบสูง มีเรื่องราวให้ต้องแบกรับตลอด บางคนต้องดูแลพ่อแม่เป็นพิเศษ หรืออาจเป็นญาติเป็นลูกหลานที่จะต้องเข้าไปดูแล มักเกี่ยวข้องกับการเดินทาง เทคโนโลยี โดยเฉพาะอย่างยิ่งเทคโนโลยที่เกี่ยวข้องกับดิน กระดาษ ต้นไม้ ก็จะยิ่งตรงตามความหมายของดาวคู่นี้มากขึ้น มักเกี่ยวข้องกับสิ่งศักดิ์สิทธิ์ การทรงเจ้า หมอดู ไสยศาสตร์ทั้งหลาย มุกเหงา ว้าเหว่"
        73 -> "มีความขัดแย้งภายในตัวเอง ขยัน อยากรวดเร็ว อยากเปลี่ยนแปลง อย่างรีบเร่ง แต่ก็ได้แค่คิดไม่ค่อยนำมาสู่ความเป็นจริงเท่าไหร่ ส่วนหนึ่งเป็นการย่ำอยู่กับที่ เป็นคนที่มีความเครียด เก็บกด อึดอัด มักใช้อำนาจในทางที่ไม่เป็นธรรม ระบบเลือดในร่างกายผิดปกติ หากเป็นสตรีประจำเดือนมักมาไม่ปกติ หรือเมื่อมีมักจะไม่สบาย มักปวดเมื่อย มักเกร็ง มักเกี่ยวข้องกับไฟไม้ ดิน กระดาษ ต้นไม้"
        74 -> "การเติบโต ขยาย โยกย้าย ขยายไปสู่สิ่งที่ดีขึ้น การเปลี่ยนแปลง การเลื่อนขั้น เลื่อนตำแหน่ง การย้ายงานใหม่ ย้ายบ้านใหม่ ซึ่งสิ่งต่างๆ เหล่านี้เป็นแนวทางที่ดีทีจะสร้างฐานที่ดีขึ้นต่อๆ ไป และบอกถึงลักษณะการพูดด้วยน้ำเสียงแข็งๆ หนักแน่น ไม่นุ่มนวล"
        75 -> "มักมีการเดินทาง เกี่ยวข้องกับสิ่งลี้ลับ มักเกี่ยวข้องกับพิธีกรรมแปลกๆ ทำอะไรผิดพลาดเกี่ยวกับสิ่งศักดิ์สิทธิ์ สิ่งศักดิ์สิทธิ์ให้โทษ คือเกิดปัญหาในสิ่งที่ไม่น่าจะเกิด ซึ่งไม่ใช่เรื่องร้ายแรง แต่ก็สร้างความกังวลใจ ปัญหาเรื่องสุขภาพมักหาสาเหตุไม่ได้ จะเป็นเองหายเอง หากไปหาหมอก็มักตรวจไม่พบ"
        76 -> "เกิดความขัดแย้ง ไม่สมดุล เกิดปัญหาต่างๆ มากมายโดยไม่จำเป็นต้องมีสาเหตุ และเกิดได้ทุกเรื่องราว เป็นดาวคู่ร้ายมากคู่หนึ่ง ความรักถูกทำลาย เกิดความผิดหวัง สูญเสียผู้ใหญ่ มีการตายจาก การแตกแยก แต่หากมีผู้ใดย้ายออกจากบ้านไป ก็เป็นการแก้เคล็ดได้ และหากเกี่ยวข้องกับการทำลายล้าง เช่น ทุบตึก การฆ่าสัตว์ ปัญหา ด้านร้ายนี้ก็อาจไม่มีหากต้องการการเกิดปัญหาจากดาวคู่นี้ควรมีเพชรใส่ประจำ"
        77 -> "การรวบรวมพลังใจ การเริ่มต้นใหม่ เพื่อการก้าวย่างที่มั่นคง ยอมทนทุกข์กับการเกิดใหม่ๆ เพื่อหวังความสำเร็จในวันหน้า หรืออาจเข้าไปเกี่ยวข้องกับ ดิน กระดาษ ต้นไม้ เช่น การทำกิจกรรมเกี่ยวกับที่ดิน โรงพิมพ์"
        78 -> "การศึกษาค้นคว้าอย่างลงลึก อย่างหนักแน่นมั่นคง มักเป็นช่วงการทำวิจัย ทำวิทยานิพนธ์ เป็นการให้ความสำคัญ การโฟกัสไปที่สิ่งหนึ่งเป็นพิเศษ แต่มีทฤษฎี มีความรู้พื้นฐานของตนเป็นที่รองรับ จึงไม่ค่อยเชื่อใคร มีการเข้าใจผิดได้ง่าย บางครั้งมีเรื่องขึ้นโรงขึ้นศาล สนใจในเอกสารเก่าๆ บ้านเก่าๆ ไม้เก่าๆ"
        79 -> "อ่อนล้า อ่อนแรงได้ง่าย สขุภาพไม่ค่อยดี ขาดความคึกคักในการปฏิบัติภารกิจต่างๆ มักปวดเมื่อยร่างกาย อยากให้คนมาบีบนวด มักสนใจไม้เก่าๆ โดยเฉพาะไม้ใหญ่ๆ หรือการนำขอนไม้ ตอไม้ มาประดับตกแตง่บ้าน"
        80 -> "มีการเดินทางเกี่ยวกับอบายมุข อาจเดินทางไปเล่นการพนันในที่ใกล้ๆ อยู่ในห้องที่มีการสื่อสาร เช่น เก็บตัวอยู่ในห้องจัดรายการวิทยุ อยู่ในห้องเพื่อเล่น อินเตอร์เน็ต หรืออยู่ในที่่ที่มีลมโชยที่มีมลภาวะ มักถูกทำให้เสียชื่อเสียง โดยการสื่อสาร โดยข่าวลือที่หาที่มาที่ไปชัดเจนไม่ได้"
        81 -> "เกี่ยวข้องกับกฎหมาย การสืบค้น ห้องแล็บ ความมืด อบายมุข รวมไปถึงการเดินทาง สื่อสาร ไปเที่ยวก็มักไปในทางวัฒนธรรมมากกว่าเชิงหรูหรา ชอบศึกษา ขุดคุ้ย ค้นคว้า ชอบซ่อมของที่เสียที่พัง เช่น จักรกล ซ่อมรถ"
        82 -> "มักเครียด เก็บกด กับปัญหาเรื่องราวเก่าๆ หนี้สิน มักใช้อำนาจที่ผู้อื่นไม่ค่อยยอมรับ เป็นไปในทางบังคับ การสั่งลูกน้องบริวาร ซึ่งการกระทำดังกล่าวอาจได้งาน ตามที่ตั้งใจแต่ไม่ได้ใจลูกน้อง มีเสน่ห์กับคนมีคู่ครองแล้ว รวมไปถึงยิ่งแต่งงานยิ่งทำให้บุคลิกดูดีขึ้น สวยขึ้น ชอบเสี่ยงโชค เก็งกำไร แต่มักไม่ค่อยประสบผล"
        83 -> "มีความสำเร็จในเรื่องเก็งกำไร หรืองานที่เกี่ยวข้องกับการปกปิดซ่อนเร้น งานเกี่ยวกับอบายมุข งานผิดกฎหมายทั้งหลาย งานเบื้องหลัง งานตัวแทนเจรจา งานนายหน้า เวลาได้อะไรมักได้แบบฟลุ๊คๆ ได้แบบไม่คิดว่าจะได้ หรือไดัรับผลประโยชน์จากอดีตที่ไม่ใส่ใจแล้ว เช่น สมัครงานไว้ จมลืมแล้วกลับได้รับเลือก"
        84 -> "มักพูดจาวกวน มีเล่ห์เหลี่ยม ไม่ตรงไปตรงมา มีการวางแผนวางประเด็น การพูดเพื่อโน้มน้าว แต่มักเก็บอาการไม่อยู่เมื่อพูดไม่ตรงกับความจริง จะตื่นเต้น มีพิรุธ ขาดความน่าเชื่อถือ เป็นการพูดแบบพ่อค้าแม่ค้า พูดเพื่อการขาย เหมาะสำหรับงานที่ต้องพูดคนเดียว เช่น นักจัดรายการวิทยุ"
        85 -> "มักมีเรื่องเดือดร้อนวุ่นวาย อันเนื่องมาจากปัญหาเก่าๆ ปัญหาในอดีต หรือเรื่องที่เกี่ยวกับหนี้สิน ศัตรูที่ไม่เผยตัว มักมีโรคภัยเก่าๆ ปะทุอย่างรุนแรง รวมไปถึงการมีคดีความ เรื่องสัญญาข้อตกลง การถูกทวงหนี้ที่เป็นปัญหาก่อให้เกิดทุกข์อย่างหนัก"
        86 -> "พูดจามีเหตุผล มีความสนใจเรื่องของความรู้ การค้นคว้าข้อมูล อาจมีผู้มาให้ข้อมูล ซึ่งข้อมูลที่ได้เป็นข้อมูลผิดๆ ไม่ถูกต้องทั้งร้อยเปอร์เซนต์ แต่มีความน่าเชื่อถือมากจนเชื่อมั่นเต็มหัวใจ ซึ่งผู้ให้ข้อมูลอาจไม่ได้ตั้งใจให้ข้อมูลผิดๆ แก่คุณ เพียงแต่สถานการณ์เปลี่ยนแปลง ข้อมูลจึงไม่ตรงตามจริงทั้งหมด"
        87 -> "การศึกษาค้นคว้าอย่างลงลึก อย่างหนักแน่นมั่นคง มักเป็นช่วงการทำวิจัย ทำวิทยานิพนธ์ เป็นการให้ความสำคัญ การโฟกัสไปที่สิ่งหนึ่งเป็นพิเศษ แต่มีทฤษฎีมีความรู้พื้นฐานของตนเป็นที่รองรับ จึงไม่ค่อยเชื่อใคร มีการเข้าใจผิดได้ง่าย บางครั้งมีเรื่องขึ้นโรงขึ้นศาล สนใจในเอกสารเก่าๆ บ้านเก่าๆ ไม้เก่าๆ"
        88 -> "เป็นคนไม่ค่อยเปิดเผย มีลับลมคมใน เป็นบุคคลมีเรื่องราวน่าค้นคว้าน่าติดตาม สืบสวนสอบสวนว่าเข้าคนนั้นเป็นใครกันแน่ แต่เชื่อว่าต้องเป็นคนดี ต้องเป็นคนเก่ง เหมือนกับบทบาทที่เห็นในภาพยนตร์ ที่ตำรวจปลอมตัวมาสืบเรื่องราวในหมู่บ้าน ซึ่งเมื่อเข้ามาแล้วก็เป็นที่ถูกใจสาวๆ มีเสน่ห์ น่าค้นหา เก่งในเรื่องสืบสวน วางแผนมีแง่มุม เป็นที่รักของคนทั่วไปจริงใจกับเพื่อนฝูง"
        89 -> "เกี่ยวข้องกับสถานที่มืดๆ ดูลึกลับน่ากลัว เป็นบ้านไม้เก่าๆ หรือบ้านปูน อาคาร ที่มีสีภาพเก่าๆ มีคราบตะไคร่ขึ้น ทำอะไรมักติดขัด ไม่คล่องแคล่ว ยกเว้นการทำงานที่เกี่ยวข้องกับของเสียหาย เช่น การทำงานที่เกี่ยวกับอุปกรณ์ จักรกล เทคโนโลยี ที่พัง รวมไปถึงสัปเหร่อ เจ้าหน้าที่ที่ทำงานในห้องศพ มักเกี่ยวพันกับศาสตร์ลี้ลับ สิ่งศักดิ์สิทธิ์ รวมไปถึงความสนใจในด้านดังกล่าว"
        90 -> "ที่โล่งๆ ดูวังเวง บ้านร้าง ซากปรักหักพัง สถานที่มีวิญญาณสิงสถิต มีความน่ากลัว น่าเกรงขาม สิ่งศักดิ์สิทธิ์ที่ศักดิ์สิทธิ์มาก การเดินทางไกล เดินทางอากาศเป็นประจำ"
        91 -> "มักทำอะไรแปลกๆ โดดเดี่ยว มีความเป็นตัวเองสูง มักแก่ง่าย ร่วงโรยเร็ว มีลางสังหรณ์ มีเซนส์พิเศษ เหมาะสำหรับงานที่เกี่ยวข้องกับคนเจ็บ คนป่วย คนตาย เช่น หมอ สัปเหร่อ พยาบาล รวมไปถึงงานโหราศาสตร์ มักชอบหาความสงบ เข้าวัด ปฏิบัติธรรม ชอบเดินทาง ท่องเที่ยว เทคโนโลยี"
        92 -> "เป็นคนมีสิ่งศักดิ์สิทธิ์คุ้มครอง สิ่งศักดิ์สิทธิ์นั้นมักเกี่ยวข้องกับน้ำ อยู่ใกล้น้ำ เช่น หลวงพ่อโสธร หลวงพ่อทวด หลวงพ่อวัดไร่ขิง เจ้าแม่กวนอิม ซึ่งสิ่งศักดิ์สิทธิ์นี้ อาจอยู่กับท่านเอง หรือมีคนนำมาให้ หรือเข้าไปผูกพันธ์ ไปกราบไหว้บูชา ไปเช่ามา นอกจากนี้จะมีความสำเร็จเกี่ยวกับเรื่องเดินทาง สื่อสาร เทคโนโลยี ศาสตร์ลี้ลับ มักชอบทำอาหาร และมีสูตรเฉพาะของตนเองที่ดัดแปลงและมีรสชาติที่ดี"
        93 -> "กระตือรือร้นในทางแปลกๆ เช่น ปรากฏการณ์ลี้ลับ เหนือธรรมชาติ ข่าวลือ เมื่อสนใจอะไรแล้วมักทุ่มเทมาก ใช้พลังงานมากเกินความจำเป็น เกินกว่าผลที่จะได้รับ บางครั้งพลังงานนั้นอาจเป็นโทษ เพราะขาดความระมัดระวัง โดนเฉพาะการปีนป่าย ซ่อมแซมที่สูง อาจเป็นเหตุให้พลัดตกได้"
        94 -> "มักเกี่ยวข้องกับการเดินทาง การสื่อสาร เทคโนโลยี มักพูดจากระทบกระเทียบ เปรียบเปรย ประชดประชัน ว่าแดกดัน พูดในลักษณะที่อ้อมค้อม ไม่ตรงไปตรงมา ไม่มีประเด็นที่จะจับมาทำความเข้าใจที่ชัดเจนได้"
        95 -> "ผู้ใหญ่มักเป็นห่วงมาก และมักแทรกแซงในการดำเนินชีวิต หรือตัดสินใจอะไรบางอย่าง ซึ่งคุณรู้สึกว่าถูกแทรกแซง ไม่ได้รับการไว้วางใจ ไม่มีอิสระ และคณุมองว่าปัญหาที่ผู้ใหญ่เข้ามาแทรกแซงนั้น เขามองไม่ทะลุไม่ลึกเท่าคุณเอง คำแนะนำเหล่านั้นจึงไม่สามารถนำไปใช้ประโยชน์ได้ แต่อย่างไรเขาก็มีเจตนาที่ดี"
        96 -> "สนใจเรื่องเทคโนโลยีเรื่องความรัก เรื่องลี้ลับ เกี่ยวข้องกับความรักวิปริต ผิดปกติ เช่น รักเพศเดียวกัน หรือมีพฤติกรรมทางเพศที่แตกต่างจากคนทั่วไป รักเทคโนโลยีชอบการเดินทาง ชอบดูภาพยนตร์มักแสวงหาความสุขทางรัก แต่มักไม่เป็นดังหวังมักมีช่องว่างกับคนรักเสมอ เหมาะกับการอยู่คนเดียว เข้าวัดปฏิบัติธรรม"
        97 -> "อ่อนล้า ออ่นแรงได้ง่าย สขุภาพไม่ค่อยดี ขาดความคึกคักในการปฏิบัติภารกิจต่างๆ มักปวดเมื่อยร่างกาย อยากให้คนมาบีบนวด มักสนใจไม้เก่า ๆ โดยเฉพาะไม้ใหญ่ๆ หรือการนำขอนไม้ ตอไม้ มาประดับตกแตง่บ้าน"
        98 -> "เกี่ยวข้องกับสถานที่มืดๆ ดูลึกลับน่ากลัว เป็นบ้านไม้เก่าๆ หรือบ้านปูน อาคาร ที่มีสีภาพเก่าๆ มีคราบตะไคร่ขึ้น ทำอะไรมักติดขัด ไม่คล่องแคล่ว ยกเว้นการทำงานที่เกี่ยวข้องกับของเสียหาย เช่น การทำงานที่เกี่ยวกับอุปกรณ์ จักรกล เทคโนโลยี ที่พัง รวมไปถึงสัปเหร่อ เจ้าหน้าที่ที่ทำงานในห้องศพ มักเกี่ยวพันกับศาสตร์ลี้ลับ สิ่งศักดิ์สิทธิ์ รวมไปถึงความสนใจในด้านดังกล่าว"
        99 -> "เป็นคนลึกลับ ดูมีพลังอำนาจในตัวเอง มีลักษณะเย็นชา เหมือนอยู่คนละโลก เป็นแพทย์ที่ชอบคิดค้น วิจัยอะไรล้าสมัย หรือเป็นเชิงวิชาการ ที่ไม่ได้ค่อยคุยกับผู้อื่นนักพวกเจ้าเข้าทรง คนเป็นโรคจิต โรคประสาท ชอบเก็บตัวอยู่ในห้องมืด ชอบงานกลางคืน มักฝันร้าย ฝันตื่นเต้น โดยเฉพาะเกี่ยวกับผี วิญญาณ คนตายไปแล้วมาหา"
        else -> null
    }
}
